<?php

return array (
  'accepted' => 'يجب قبول السمة:.',
  'after' => 'يجب أن تكون السمة تاريخًا بعد: التاريخ.',
  'after_or_equal' => 'يجب أن تكون السمة تاريخًا بعد: التاريخ أو مساويًا له.',
  'alpha' => 'لا يجوز أن تحتوي السمة: إلا على أحرف.',
  'alpha_dash' => 'لا يجوز أن تحتوي السمة: إلا على أحرف وأرقام وشرطات وشرطات سفلية.',
  'alpha_num' => 'لا يجوز أن تحتوي السمة: إلا على أحرف وأرقام.',
  'array' => 'يجب أن تكون السمة مصفوفة.',
  'before' => 'يجب أن تكون السمة تاريخًا قبل: التاريخ.',
  'before_or_equal' => 'يجب أن تكون السمة تاريخًا يسبق: التاريخ أو مساويًا له.',
  'between' => 
  array (
    'array' => 'يجب أن تحتوي السمة: على ما بين: min و: max من العناصر.',
    'file' => 'يجب أن تكون السمة: بين: min و: max كيلوبايت.',
    'numeric' => 'يجب أن تكون السمة: بين: min و: max.',
    'string' => 'يجب أن تكون السمة: بين: min و: max حرفًا.',
  ),
  'boolean' => 'يجب أن يكون حقل السمة: صح أو خطأ.',
  'confirmed' => 'تأكيد السمة غير مطابق.',
  'custom' => 
  array (
    'attribute-name' => 
    array (
      'rule-name' => 'رسالة مخصصة',
    ),
  ),
  'date' => 'السمة: ليست تاريخًا صالحًا.',
  'date_equals' => 'يجب أن تكون السمة تاريخًا مساويًا لـ: التاريخ.',
  'date_format' => 'السمة: لا تطابق التنسيق: format.',
  'different' => 'يجب أن يكون: السمة و: الآخر مختلفين.',
  'digits' => 'يجب أن تكون السمة: أرقامًا وأرقامًا.',
  'digits_between' => 'يجب أن تكون السمة: بين: min و: max أرقام.',
  'dimensions' => 'السمة لها أبعاد صورة غير صالحة.',
  'email' => 'يجب أن تكون السمة عنوان بريد إلكتروني صالحًا.',
  'ends_with' => 'يجب أن تنتهي السمة: بأحد القيم التالية:',
  'exists' => 'السمة المحددة: غير صالحة.',
  'file' => 'يجب أن تكون السمة: ملفًا.',
  'filled' => 'يجب أن يحتوي حقل السمة على قيمة.',
  'gt' => 
  array (
    'array' => 'يجب أن تحتوي السمة: على أكثر من: عناصر القيمة.',
    'file' => 'يجب أن تكون السمة: أكبر من: القيمة كيلوبايت.',
    'numeric' => 'يجب أن تكون السمة: أكبر من: القيمة.',
    'string' => 'يجب أن تكون السمة: أكبر من: أحرف القيمة.',
  ),
  'gte' => 
  array (
    'array' => 'يجب أن تحتوي السمة: على عناصر قيمة أو أكثر.',
    'file' => 'يجب أن تكون السمة: أكبر من أو تساوي: القيمة كيلوبايت.',
    'numeric' => 'يجب أن تكون السمة: أكبر من أو تساوي: القيمة',
    'string' => 'يجب أن تكون السمة: أكبر من أو تساوي: أحرف القيمة.',
  ),
  'image' => 'يجب أن تكون السمة صورة.',
  'in' => 'السمة المحددة: غير صالحة.',
  'in_array' => 'حقل السمة: غير موجود في: أخرى.',
  'integer' => 'يجب أن تكون السمة عددًا صحيحًا.',
  'ip' => 'يجب أن تكون السمة: عنوان IP صالحًا.',
  'ipv4' => 'يجب أن تكون السمة عنوان IPv4 صالحًا.',
  'ipv6' => 'يجب أن تكون السمة: عنوان IPv6 صالحًا.',
  'json' => 'يجب أن تكون السمة: سلسلة JSON صالحة.',
  'lt' => 
  array (
    'array' => 'يجب أن تحتوي السمة على أقل من: عناصر القيمة.',
    'file' => 'يجب أن تكون السمة: أقل من: value كيلوبايت.',
    'numeric' => 'يجب أن تكون السمة: أقل من: القيمة.',
    'string' => 'يجب أن تكون السمة: أقل من: أحرف القيمة.',
  ),
  'lte' => 
  array (
    'array' => 'يجب ألا تحتوي السمة: على أكثر من: عناصر القيمة.',
    'file' => 'يجب أن تكون السمة: أقل من أو تساوي: القيمة كيلوبايت.',
    'numeric' => 'يجب أن تكون السمة: أقل من أو تساوي: القيمة.',
    'string' => 'يجب أن تكون السمة: أقل من أو تساوي: أحرف القيمة.',
  ),
  'match_with_old_password' => 'يجب أن تتطابق السمة مع كلمة المرور القديمة.',
  'max' => 
  array (
    'array' => 'لا يجوز أن تحتوي السمة: على أكثر من: max items.',
    'file' => 'لا يجوز أن تكون السمة: أكبر من: أقصى كيلوبايت.',
    'string' => 'لا يجوز أن تكون السمة: أكبر من: الحد الأقصى من الأحرف.',
  ),
  'mimes' => 'يجب أن تكون السمة: ملفًا من النوع: القيم.',
  'min' => 
  array (
    'file' => 'يجب ألا تقل السمة: عن: دقيقة كيلوبايت.',
    'numeric' => 'يجب أن تكون سمة: على الأقل: min.',
    'string' => 'يجب ألا تقل السمة: عن: min حرفًا.',
  ),
  'not_in' => 'السمة المحددة: غير صالحة.',
  'numeric' => 'يجب أن تكون السمة رقمًا.',
  'password' => 'كلمة المرور غير صحيحة.',
  'regex' => 'تنسيق السمة: غير صالح.',
  'required' => ': حقل السمة مطلوب.',
  'required_if' => 'يكون حقل السمة مطلوبًا عندما: الآخر هو: القيمة.',
  'required_unless' => 'حقل السمة مطلوب إلا إذا كان الآخر في: قيم.',
  'required_with' => 'يكون حقل السمة مطلوبًا عندما تكون: القيم موجودة.',
  'required_with_all' => 'يكون حقل السمة مطلوبًا عندما تكون: القيم موجودة.',
  'required_without' => 'يكون حقل السمة مطلوبًا عندما: القيم غير موجودة.',
  'same' => 'يجب أن يتطابق السمة: و: الآخر.',
  'size' => 
  array (
    'array' => 'يجب أن تحتوي السمة: على عناصر الحجم.',
    'file' => 'يجب أن تكون السمة: الحجم كيلوبايت.',
    'numeric' => 'يجب أن تكون السمة: الحجم.',
    'string' => 'يجب أن تكون السمة: أحرف الحجم.',
  ),
  'starts_with' => 'يجب أن تبدأ السمة: بأحد القيم التالية:',
  'string' => 'يجب أن تكون السمة: سلسلة.',
  'timezone' => 'يجب أن تكون السمة: منطقة صالحة.',
  'unique' => 'تم استخدام السمة: بالفعل.',
  'uploaded' => 'فشل تحميل السمة:.',
  'url' => 'تنسيق السمة: غير صالح.',
  'uuid' => 'يجب أن تكون السمة: UUID صالحًا.',
);
